{"total":110,"courses":[{"name":null,"code":"MATH1002","desc":null},{"name":"Calculus for Engineering or Physics","code":"MATH1004","desc":"Limits. Differentiation of the elementary functions. Rules of differentiation. Inverse trigonometric functions. Applications of differentiation: max-min problems, curve sketching, approximations. Definite and indefinite integrals, techniques of integration. Applications to areas and volumes."},{"desc":"First-order differential equations. Second-order linear equations with constant coefficients, undetermined coefficients, variation of parameters. Sequences and series, convergence tests, estimation of sums. Power series, Taylor series, remainders. Fourier series.","name":"Differential Equations and Infinite Series for Engineering or Physics","code":"MATH1005"},{"code":"MATH1007","name":"Elementary Calculus I","desc":"Limits. Differentiation of the elementary functions, including trigonometric functions. Rules of differentiation. Applications of differentiation:  max-min problems, curve sketching, approximations. Introduction to integration: definite and indefinite integrals, areas under curves, fundamental theorem of calculus."},{"code":"MATH1009","name":"Mathematics for Business","desc":"An introductory course of mathematics for business. Thorough review of basic arithmetic and algebra. Elementary functions, their graphs, properties and applications in business models. Limits. Derivatives of elementary functions. Systems of linear equations/inequalities. Geometric series."},{"code":"MATH1052","name":"Calculus and Introductory Analysis I","desc":"Properties of the real numbers. Limits. Sequences and series. Elementary functions. Continuity. Derivatives. Extreme values. Mean Value Theorem. L’Hospital’s rules. Antiderivatives. An emphasis is placed on proofs and theory."},{"name":null,"code":"MATH1102","desc":null},{"code":"MATH1104","name":"Linear Algebra for Engineering or Science","desc":"Systems of linear equations. Matrix algebra. Determinants. Invertible matrix theorem. Cramer’s rule. Vector space R^n; subspaces, bases. Eigenvalues, diagonalization. Linear transformations, kernel, range.  Complex numbers (including De Moivre’s theorem). Inner product spaces and orthogonality. Applications."},{"code":"MATH1107","name":"Linear Algebra I","desc":"Systems of linear equations; vector space of n-tuples, subspaces, bases; matrix transformations, kernel, range; matrix algebra and determinants. Dot product. Complex numbers (including de Moivre's Theorem, and n-th roots). Eigenvalues, diagonalization and applications. Note: MATH1119 is not an acceptable substitute for  MATH1107."},{"code":"MATH1119","name":"Linear Algebra: with Applications to Business","desc":"Introduction to systems of linear equations, geometric interpretation in two and three dimensions, introduction to matrices, vector addition and scalar multiplication, linear dependence, matrix operations, rank, inversion, invertible matrix theorem, determinants. Use of illustrative examples related to business."},{"name":"Introductory Algebra I","code":"MATH1152","desc":"Properties of numbers. Modular arithmetic. Fields, including complex numbers and finite fields. Vector spaces. Matrix algebra. Solutions of linear systems. Linear dependence. Spanning sets. Bases. Subspaces. The rank-nullity theorem. Linear transformations. An emphasis is placed on proofs and theory."},{"name":"Elementary Mathematics for Economics I","code":"MATH1401","desc":"Functional relations:  functional forms and error terms. Graphing economic magnitudes:  scatter diagrams, time-series graphs, functional relationships. Applied calculus:  mechanics of differentiation and integration, elasticity, consumer/producer surplus. Applied algebra:  solving systems of linear equations and Keynesian national-income analysis. Problem solving approaches."},{"desc":"Calculus: including partial differentiation, definite and indefinite integrals, techniques of integration, and unconstrained optimization. Vectors and matrices: scalar multiplication, inner product, linear dependence, matrix operations, rank, invertible matrix theorem, and determinants. Economic applications such as profit maximization, comparative statics, and the Leontief input-output model.","code":"MATH1402","name":"Elementary Mathematics for Economics II"},{"desc":"Elementary logic, propositional and predicate calculus, quantifiers, sets and functions, bijections and elementary counting, the concept of infinity, relations, well ordering and induction.  The practice of mathematical proof in elementary number theory and combinatorics.","name":"Introduction to Mathematical Reasoning","code":"MATH1800"},{"desc":"Introduction to discrete mathematics and discrete structures. Topics include: propositional logic,  predicate calculus, set theory, complexity of algorithms, mathematical reasoning and proof techniques, recurrences, induction, finite automata and graph theory.  Material is illustrated through examples from computing.","code":"MATH1805","name":"Discrete Structures I"},{"desc":"Higher dimensional calculus, chain rule, gradient, line and multiple integrals with applications. Use of implicit and inverse function theorems. Real number axioms, limits, continuous functions, differentiability, infinite series, uniform convergence, the Riemann integral.","code":"MATH2000","name":"Multivariable Calculus and Fundamentals of Analysis"},{"code":"MATH2004","name":"Multivariable Calculus for Engineering or Physics","desc":"Curves and surfaces. Polar, cylindrical and spherical coordinates. Partial derivatives, gradients, extrema and Lagrange multipliers. Exact differentials. Multiple integrals over rectangular and general regions. Integrals over surfaces. Line integrals. Vector differential operators. Green’s Theorem, Stokes’ theorem, Divergence Theorem. Applications."},{"desc":"Techniques of integration, improper integrals.  Polar coordinates, parametric equations.  Indeterminate forms, sequences and series, Taylor's formula and series.","name":"Elementary Calculus II","code":"MATH2007"},{"desc":"Partial differentiation, chain rule, gradient, line and multiple integrals with applications, transformations of multiple integrals.","code":"MATH2008","name":"Intermediate Calculus"},{"desc":null,"name":null,"code":"MATH2009"},{"desc":"Definite, indefinite integrals. Improper integrals. The fundamental theorem of calculus. An introduction to differential equations. Sequences and series of functions. Power series. Taylor’s formulae. Uniform convergence. An emphasis is placed on proofs and theory.","code":"MATH2052","name":"Calculus and Introductory Analysis II"},{"name":"Algebra","code":"MATH2100","desc":"Introduction to group theory: permutation groups, Lagrange's theorem, normal subgroups, homomorphism theorems. Introduction to ring theory: ring of polynomials, integral domains, ideals, homomorphism theorems. Hermitian forms, spectral theorem for normal operators, bilinear and quadratic forms, classical groups."},{"name":"Linear Algebra II","code":"MATH2107","desc":"Finite-dimensional vector spaces (over R and C), subspaces, linear independence and bases. Linear transformations and matrices. Inner product spaces (over R and C); Orthonormal bases. Eigenvalues and diagonalization. Bilinear and quadratic forms; principal axis theorem."},{"desc":"Sets and relations, number theory, group theory, ring theory, cardinal numbers.","name":"Abstract Algebra I","code":"MATH2108"},{"name":"Introductory Algebra II","code":"MATH2152","desc":"Linear transformations. Determinants. Eigenvalues and eigenspaces. Diagonalization and other canonical forms. Inner products. An emphasis is placed on proofs and theory."},{"code":"MATH2200","name":null,"desc":null},{"name":"Ordinary Differential Equations I","code":"MATH2404","desc":"First-order equations, linear second- and higher-order equations, linear systems, stability of second-order systems."},{"desc":"Existence and uniqueness theorems. First-order equations, linear second- and higher-order equations, linear systems, stability of second-order systems.","code":"MATH2454","name":"Ordinary Differential Equations (Honours)"},{"code":"MATH2800","name":"Discrete Mathematics and Algorithms","desc":"An introduction to discrete mathematics and algorithms in the context of the computational sciences. Basic number theory and counting methods, algorithms for strings, trees and sequences. Applications to DNA and protein sequencing problems. Analysis and complexity of algorithms."},{"desc":null,"name":null,"code":"MATH2907"},{"desc":"Metric spaces and their topologies, continuous maps, completeness, compactness, connectedness, introduction to Banach spaces.","name":"Real Analysis I (Honours)","code":"MATH3001"},{"desc":"Function spaces, pointwise and uniform convergence, Weierstrass approximation theorem, Lebesgue measure and Lebesgue integral on the real line, Hilbert space, Fourier series.","name":"Real Analysis II (Honours)","code":"MATH3002"},{"desc":"Review of multivariable differentiation and integration.  Vector fields, differential forms and exterior algebra.  Introduction to manifolds and tangent bundles. Stokes’ Theorem. Applications such as differential equations and the calculus of variations.","code":"MATH3003","name":"Advanced Differential Calculus (Honours)"},{"desc":"Analytic functions, contour integration, residue calculus, conformal mapping. Intended for non-engineering students.","name":"Functions of a Complex Variable","code":"MATH3007"},{"desc":"Analytic ordinary differential equations: series solutions of ordinary differential equations about ordinary and regular singular points. Asymptotic solutions. Sturm-Liouville theory. Bessel and Legendre functions. Fourier series.","name":"Ordinary Differential Equations (Honours)","code":"MATH3008"},{"code":"MATH3057","name":"Functions of a Complex Variable (Honours)","desc":"Analytic functions, contour integration, residue calculus, conformal mappings."},{"name":"Algebraic Structures with Computer Applications","code":"MATH3101","desc":"Introduction to algebraic structures: groups, rings, fields, lattices, and Boolean algebras; with applications of interest to students in Computer Science.  This course may not be used to meet the 3000-level course requirements in any B.Math or B.Math Honours program in Mathematics and Statistics."},{"desc":"Homomorphism theorems; groups acting on sets; permutation groups and groups of matrices; Sylow theory for finite groups; finitely generated abelian groups; generators and relations; applications.","code":"MATH3106","name":"Introduction to Group Theory (Honours)"},{"desc":"Similarity and unitary triangularization of matrices. Direct methods of solving a system of linear equations. Iterative techniques. Bounds for eigenvalues. Power method and deflation techniques of approximation. Emphasis is primarily on computational aspects.","code":"MATH3107","name":"Linear Algebra III"},{"desc":"Rings, integral domains, Euclidean and principal ideal domains, fields, polynomial rings over a field, algebraic extensions of fields, the fundamental theorem of Galois theory, finite fields, applications.","code":"MATH3158","name":"Rings and Fields (Honours)"},{"code":"MATH3200","name":null,"desc":null},{"desc":null,"name":null,"code":"MATH3201"},{"name":"Euclidean and Non-Euclidean Geometry","code":"MATH3210","desc":"Euclidean isometry and similarity groups; geometry of circles; inversion; hyperbolic geometry: Poincare disk model of the hyperbolic plane."},{"desc":"Axioms of set theory. Development of the systems of natural numbers and the real numbers. Axiom of choice, Zorn's lemma, well-ordering. The Schröder-Bernstein theorem, cardinal numbers, ordinal numbers, transfinite induction, cardinal and ordinal arithmetics.","name":"Elements of Set Theory (Honours)","code":"MATH3306"},{"code":"MATH3355","name":"Number Theory and Applications (Honours)","desc":"Congruences, distribution of primes, arithmetic functions, primitive roots, quadratic residues, quadratic reciprocity law, continued fractions, Diophantine equations, and applications:  public key cryptography, primality testing and factoring in relation to cryptography."},{"code":"MATH3705","name":"Mathematical Methods I","desc":"Laplace transforms, series solutions of ordinary differential equations, the Frobenius method. Fourier series and Fourier transforms, solutions of partial differential equations of mathematical physics, boundary value problems, applications."},{"name":"Mathematical Modeling and Computational Methods","code":"MATH3800","desc":"Design and analysis of mathematical models for problems in science. Computational methods, including function evaluation, interpolation, solution of linear equations, root finding, integration, solution of differential equations, Fourier series and Monte Carlo methods."},{"name":"Linear Programming","code":"MATH3801","desc":"Systems of linear inequalities, formulation of linear programming problems, geometric method, the simplex method, duality theory, complementary slackness, sensitivity analysis, branch-and-bound method and cutting plane method for integer linear programming, applications and extensions."},{"name":"Combinatorial Optimization","code":"MATH3802","desc":"Network flow problems, network simplex method, max-flow min-cut problem, integral polyhedra, minimum-weight spanning tree problem, maximum matching problem, maximum stable set problem, introduction to approximation algorithms."},{"desc":"An introduction to the design and analysis of algorithms. Topics include: recurrence relations, sorting and searching, divide-and-conquer, dynamic programming, greedy algorithms, NP-completeness.","code":"MATH3804","name":"Design and Analysis of Algorithms I"},{"desc":"Elementary discussion of error, polynomial interpolation, quadrature, linear systems of equations and matrix inversion, non-linear equations, difference equations and ordinary differential equations. Implementation of numerical methods using a computer language.","name":"Numerical Analysis (Honours)","code":"MATH3806"},{"desc":"Implementation of numerical methods using numerical software packages. Development of scientific and/or operations research applications using application programming interfaces of numerical or optimization libraries. Functional programming for data analysis and machine learning. Experience working with Python, C++, or Java is essential.","code":"MATH3807","name":"Mathematical Software  (Honours)"},{"code":"MATH3808","name":"Mathematical Analyses of Games of Chance","desc":"This course covers mathematics used in the modern casino gaming industry. The topics include probabilities, odds, house advantages, variance and risks, optimal strategies, random walks and gambler's ruin, and gaming revenue estimation. Examples are taken from various games such as Roulette, Blackjack, and Poker."},{"name":"Introduction to Number Theory and Cryptography","code":"MATH3809","desc":"Congruences, distribution of primes, general cryptographic systems, public key cryptographic systems and authentification using number theory, primality testing and factoring in relation to cryptography, continued fractions and Diophantine equations."},{"desc":"Algorithms for multiplication, division, greatest common divisors and factorization over the integers, finite fields and polynomial rings. Basic tools include modular arithmetic, discrete Fourier transform, Chinese remainder theorem, Newton iteration, and Hensel techniques. Some properties of finite fields and applications to cryptography.","name":"Modern Computer Algebra","code":"MATH3819"},{"desc":"Enumeration: elementary methods, inclusion and exclusion, recurrence relations, generating functions and applications. Graph theory and algorithms: connectivity, planarity, Hamilton paths and Euler trails. Error-correcting codes.","name":"Discrete Structures and Applications","code":"MATH3825"},{"desc":"Enumeration: inclusion and exclusion, recurrence relations, generating functions and applications. Graph theory: connectivity, planarity, Hamilton paths and Euler trails. Error-correcting codes. Designs and finite geometries. Symmetry and counting.","name":"Discrete Structures and Applications (Honours)","code":"MATH3855"},{"desc":null,"name":null,"code":"MATH3907"},{"desc":"On completion of each work term, the student must submit to the School of Mathematics and Statistics a written report on the work performed. Graded Sat or Uns.","code":"MATH3999","name":"Co-operative Work Term Report (Honours)"},{"code":"MATH4002","name":"Fourier Analysis (Honours)","desc":"Fourier series, Fourier integrals; introduction to harmonic analysis on locally compact abelian groups, Plancherel Theorem, Pontryagin duality; selected applications."},{"desc":"Banach spaces and bounded linear operators, Hahn-Banach extension and separation, dual spaces, bounded inverse theorems, uniform boundedness principle, applications. Compact operators.","code":"MATH4003","name":"Functional Analysis (Honours)"},{"desc":"Lebesgue measure and integration on the real line; sigma algebras and measures; integration theory; Lp spaces; Fubini's theorem; decomposition theorems and Radon-Nikodym derivatives.","code":"MATH4007","name":"Measure and Integration Theory (Honours)"},{"code":"MATH4102","name":"Group Representations and Applications (Honours)","desc":"An introduction to the group representations and character theory, with selected applications."},{"desc":"Fundamental principles as applied to abelian, nilpotent, solvable, free and finite groups; representations.","name":"Group Theory (Honours)","code":"MATH4106"},{"desc":"Fields, including algebraic and transcendental extensions, Galois theory, valuation theory; Noetherian commutative rings, including Noether decomposition theorem and localization.","name":"Commutative Algebra (Honours)","code":"MATH4107"},{"code":"MATH4109","name":"Fields and Coding Theory (Honours)","desc":"Introduction to field theory, emphasizing the structure of finite fields, primitive elements and irreducible polynomials. The influence of computational problems will be considered. Theory and applications of error-correcting codes: algebraic codes, convolution codes, decoding algorithms, and analysis of code performance."},{"name":null,"code":"MATH4200","desc":null},{"code":"MATH4201","name":null,"desc":null},{"code":"MATH4205","name":"Introduction to General Topology (Honours)","desc":"Topological spaces, maps, subspaces, product and identification topologies, separation axioms, compactness, connectedness."},{"desc":"An introduction to homotopy theory. Topics include the fundamental group, covering spaces and the classification of two-dimensional manifolds.","name":"Introduction to Algebraic Topology (Honours)","code":"MATH4206"},{"code":"MATH4305","name":"Analytic Number Theory (Honours)","desc":"Dirichlet series, characters, Zeta-functions, prime number theorem, Dirichlet's theorem on primes in arithmetic progressions, binary quadratic forms."},{"code":"MATH4306","name":"Algebraic Number Theory (Honours)","desc":"Algebraic number fields, bases, algebraic integers, integral bases, arithmetic in algebraic number fields, ideal theory, class number."},{"code":"MATH4700","name":"Partial Differential Equations (Honours)","desc":"First-order partial differential equations. Classification of second-order linear partial differential equations; the diffusion equation, wave equation and Laplace's equation; separation of variables; Fourier and Laplace transform methods for the solution of initial/boundary value problems; Green's functions."},{"desc":"Topics in the theory and application of differential equations; for example, hyperbolic systems, fluid dynamics, nonlinear wave equations, optimal mass transport, control theory, calculus of variations.","code":"MATH4701","name":"Topics in Differential Equations (Honours)"},{"code":"MATH4703","name":"Dynamical Systems (Honours)","desc":"Basic concepts of dynamical systems.  Vector formulation for systems.  Theory of autonomous systems in one, two and higher dimensions.  Limit sets, stability.  Phase plane, qualitative interpretation, limit cycles and attractors.  Parametric dependence, bifurcations and chaos.  Applications."},{"name":"Asymptotic Methods of Applied Mathematics (Honours)","code":"MATH4708","desc":"Asymptotic series: properties, matching, application to differential equations. Asymptotic expansion of integrals:  elementary methods, methods of Laplace, stationary phase and steepest descent, Watson’s lemma, Riemann-Lebesgue lemma. Perturbation methods: regular and singular perturbation for differential equations, multiple scale analysis, boundary layer theory, WKB theory."},{"desc":"An in-depth study of one or more topics from: generating functions, Polya's theory of counting, block designs, coding theory, partially ordered sets and Ramsey theory.","name":"Topics in Combinatorics (Honours)","code":"MATH4801"},{"desc":"Symbolic logic, propositional and predicate calculi, set theory and model theory, completeness.","name":"Introduction to Mathematical Logic (Honours)","code":"MATH4802"},{"desc":"Recursive functions and computability, algorithms, Church's thesis, Turing machines, computational logic, NP-completeness.","name":"Computable Functions (Honours)","code":"MATH4803"},{"code":"MATH4805","name":"Theory of Automata (Honours)","desc":"Finite automata and regular expressions, properties of regular sets, context-free grammars, pushdown automata, deterministic context-free languages. Turing machines, the Chomsky hierarchy. Undecidability, intractable problems."},{"name":"Numerical Linear Algebra (Honours)","code":"MATH4806","desc":"Matrix computations, conditioning/stability, direct methods for linear systems, classical iterative methods: Jacobi, Gauss-Seidel; modern iterative methods, Arnoldi decomposition, GMRES and other Krylov subspace-based methods for sparse and structured matrices; numerical solution of eigenvalue problems,  implementation using suitable programming language, application to differential equations/optimization problems."},{"desc":"One-player games, two-player zero-sum games, multi-player games, games in normal form, games in extensive form, utility theory, Nash equilibrium and Nash arbitration scheme, games in characteristic function form, cooperative solutions, dominations, stable sets, core, Shapley value, applications of game theory.","code":"MATH4807","name":"Game Theory (Honours)"},{"desc":"Paths, circuits, Eulerian and Hamiltonian graphs, connectivity, colouring problems, matching, Ramsey theory, network flows.","code":"MATH4808","name":"Graph Theory and Algorithms (Honours)"},{"desc":"Topics covered include: a general survey of public key cryptography; classical applications of finite fields and number theory; relevant background in geometry and algebraic curves; computational issues concerning elliptic curves; elliptic curve cryptosystems; security issues.","code":"MATH4809","name":"Mathematical Cryptography (Honours)"},{"desc":"Existence and construction of combinatorial designs: finite geometries, pairwise balanced designs, balanced incomplete block designs, Steiner triple systems, symmetric designs, PBD closure, latin squares, transversal designs, and applications to information theory.","code":"MATH4811","name":"Combinatorial Design Theory (Honours)"},{"code":"MATH4816","name":"Numerical Analysis for Differential Equations (Honours)","desc":"Floating point arithmetic; numerical solution of ODEs; finite difference methods for PDEs; stability, accuracy and convergence:  von Neumann analysis, CFL condition, Lax Theorem.  Finite element methods:  boundary value problems and elliptic PDEs.  Spectral and pseudo-spectral methods."},{"name":"Quantum Computing (Honours)","code":"MATH4821","desc":"Space of quantum bits; entanglement. Observables in quantum mechanics. Density matrix and Schmidt decomposition. Quantum cryptography. Classical and quantum logic gates. Quantum Fourier transform. Shor's quantum algorithm for factorization of integers."},{"name":"Wavelets and Digital Signal Processing (Honours)","code":"MATH4822","desc":"Lossless compression methods. Discrete Fourier transform and Fourier-based compression methods. JPEG and MPEG. Wavelet analysis. Digital filters and discrete wavelet transform. Daubechies wavelets. Wavelet compression."},{"code":"MATH4905","name":"Honours Project (Honours)","desc":"Consists of a written report on some approved topic or topics in the field of mathematics, together with a short lecture on the report."},{"desc":null,"name":null,"code":"MATH4906"},{"code":"MATH4907","name":null,"desc":null},{"desc":null,"code":"MECH3310","name":null},{"code":"MECH3700","name":null,"desc":null},{"desc":null,"name":null,"code":"MECH3710"},{"desc":null,"name":null,"code":"MECH4003"},{"code":"MECH4006","name":null,"desc":null},{"name":null,"code":"MECH4007","desc":null},{"code":"MECH4013","name":null,"desc":null},{"code":"MECH4101","name":null,"desc":null},{"desc":null,"name":null,"code":"MECH4210"},{"desc":null,"code":"MECH4305","name":null},{"code":"MECH4403","name":null,"desc":null},{"code":"MECH4406","name":null,"desc":null},{"desc":null,"name":null,"code":"MECH4407"},{"code":"MECH4408","name":null,"desc":null},{"code":"MECH4503","name":null,"desc":null},{"code":"MECH4604","name":null,"desc":null},{"name":null,"code":"MECH4705","desc":null},{"desc":null,"name":null,"code":"MECH4805"},{"desc":null,"code":"MECH4806","name":null}]}